{"class_name": "Model", "keras_version": "2.0.8", "config": {"output_layers": [["activation_5", 0, 0]], "name": "sequential_1_model", "layers": [{"class_name": "InputLayer", "name": "conv2d_1_input", "config": {"dtype": "float32", "sparse": false, "name": "conv2d_1_input", "batch_input_shape": [null, 150, 150, 3]}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"dtype": "float32", "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "batch_input_shape": [null, 150, 150, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "strides": [1, 1], "filters": 32, "padding": "valid", "trainable": true, "kernel_regularizer": null, "name": "conv2d_1", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null}, "inbound_nodes": [[["conv2d_1_input", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_1", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"trainable": true, "name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "filters": 32, "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_2", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2", "config": {"trainable": true, "name": "max_pooling2d_2", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "filters": 64, "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_3", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_3", "config": {"trainable": true, "name": "max_pooling2d_3", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"units": 64, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "name": "dense_1", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_4", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"trainable": true, "name": "dropout_1", "rate": 0.5}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"units": 2, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "name": "dense_2", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_5", "config": {"trainable": true, "name": "activation_5", "activation": "softmax"}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}], "input_layers": [["conv2d_1_input", 0, 0]]}, "backend": "tensorflow"}